In [6]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.arange(16).reshape(4,4),index=np.arange(4),columns=list('ABCD'))
df

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
#Read selection

In [8]:
df['B']

0     1
1     5
2     9
3    13
Name: B, dtype: int32

In [12]:
df[0:1]

   A  B  C  D
0  0  1  2  3

In [15]:
df.loc[1]

A    4
B    5
C    6
D    7
Name: 1, dtype: int32

In [17]:
df.loc[0:2,['A','B']]

   A  B
0  0  1
1  4  5
2  8  9

In [20]:
df.iloc[0:3,0:3]

   A  B   C
0  0  1   2
1  4  5   6
2  8  9  10

In [21]:
df.iloc[[1,2,3],[1,2]]

    B   C
1   5   6
2   9  10
3  13  14

In [22]:
df

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [25]:
df.at[1,'A']

4

In [26]:
df.iat[1,1]

5

In [27]:
df

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [32]:
df.loc[1,'A']=44

In [33]:
df

    A   B   C   D
0   0   1   2   3
1  44   5   6   7
2   8   9  10  11
3  12  13  14  15

In [34]:
s = pd.Series(np.arange(4))

In [35]:
df['E']=s

In [36]:
df

    A   B   C   D  E
0   0   1   2   3  0
1  44   5   6   7  1
2   8   9  10  11  2
3  12  13  14  15  3

In [39]:
df.drop('A',axis=1)

    B   C   D  E
0   1   2   3  0
1   5   6   7  1
2   9  10  11  2
3  13  14  15  3